src/InformationRegisters/ОшибкиЗагрузкиОП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЗагрузкиОП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибкиДляСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>document_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСвязи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОшибкиЗагрузкиОП/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		_НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиОП.СоздатьНаборЗаписей();
		_НаборЗаписей.Отбор.НомерДокумента.Установить(ЭтотОбъект.Отбор.НомерДокумента.Значение);
		_НаборЗаписей.Отбор.КлючСвязи.Установить(ЭтотОбъект.Отбор.КлючСвязи.Значение);
		_НаборЗаписей.Отбор.Период.Установить(ЭтотОбъект.Отбор.Период.Значение);
		_Массив = Новый Массив;
		_Массив.Добавить(ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика, 3));
		ПланыОбмена.УдалитьРегистрациюИзменений(_Массив, _НаборЗаписей);
	Иначе
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			_НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиОП.СоздатьНаборЗаписей();
			_НаборЗаписей.Отбор.НомерДокумента.Установить(ТекущаяЗапись.НомерДокумента);
			_НаборЗаписей.Отбор.КлючСвязи.Установить(ТекущаяЗапись.КлючСвязи);
			_НаборЗаписей.Отбор.Период.Установить(ТекущаяЗапись.Период);
			_Массив = Новый Массив;
			_Массив.Добавить(ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика, 3));
			ПланыОбмена.ЗарегистрироватьИзменения(_Массив, _НаборЗаписей);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
